{
  "categories": [
    {
      "name": "Веб-розробка",
      "services": [
        {
          "title": "Створення корпоративних сайтів та особистих кабінетів",
          "description": "Розробка сучасних корпоративних сайтів, внутрішніх порталів та особистих кабінетів для співробітників або клієнтів. Включає зручну адмін-панель, систему ролей, керування контентом та інтеграцію з внутрішніми сервісами компанії.",
          "focus": "Підходить компаніям, яким потрібна професійна онлайн-платформа для команди чи клієнтів.",
          "tech": ["Next.js", "React", "Django", "Node.js", "PostgreSQL"]
        },
        {
          "title": "Розробка CRM та внутрішніх систем",
          "description": "Створення CRM для продажів, підтримки клієнтів або автоматизації бізнес-процесів. Системи включають розподілення задач, трекінг угод, статистику, логування дій, інтеграції з email та месенджерами.",
          "focus": "Для бізнесів, що хочуть підвищити ефективність роботи, автоматизувати рутину та покращити комунікацію.",
          "tech": ["Django", "DRF", "FastAPI", "PostgreSQL", "Supabase"]
        },
        {
          "title": "Розробка високопродуктивних backend-сервісів",
          "description": "Побудова надійних серверних додатків, що витримують високе навантаження. Оптимізація запитів, кешування, асинхронна логіка, масштабування.",
          "focus": "Для продуктів з великою аудиторією, маркетплейсів, аналітики чи чату.",
          "tech": ["FastAPI", "Django", "Node.js", "PostgreSQL", "Redis"]
        },
        {
          "title": "Створення REST API та інтеграції з сервісами",
          "description": "Розробка API, яким можуть користуватися мобільні додатки, веб-додатки та сторонні платформи. Підключення сторонніх сервісів: оплати, геолокація, email, SMS, чат-боти, маркетплейси.",
          "focus": "Для бізнесів, що хочуть масштабувати продукт або інтегрувати його в інші системи.",
          "tech": ["DRF", "FastAPI", "Node.js", "OAuth2", "JWT"]
        },
        {
          "title": "Реєстрація, авторизація та управління доступом",
          "description": "Надійні механізми авторизації: email/пароль, соцмережі, OAuth2, JWT, багаторівневі ролі. Системи відновлення доступу, підтвердження email, обмеження доступу до ресурсів.",
          "focus": "Для платформ, де важлива безпека та персоналізація користувача.",
          "tech": ["JWT", "OAuth2", "Django Auth", "NextAuth"]
        },
        {
          "title": "Адаптивні інтерфейси та сучасний UI/UX",
          "description": "Розробка привабливих та зручних інтерфейсів, які однаково добре працюють на телефоні, планшеті та комп’ютері. Анімації, сучасні компоненти, зручна навігація.",
          "focus": "Для проєктів, де важливе враження користувача та високий рівень зручності.",
          "tech": ["React", "Next.js", "Tailwind", "Framer Motion"]
        },
        {
          "title": "Інтеграція платежів, форм та аналітики",
          "description": "Підключення платіжних систем (Stripe, LiqPay, Fondy), форм збереження даних, CRM-зв’язків, Google Analytics, Facebook Pixel, heatmaps.",
          "focus": "Для eCommerce, сервісів з оплатою, передплатами чи збором заявок.",
          "tech": ["Node.js", "Next.js", "Stripe API", "LiqPay API"]
        },
        {
          "title": "SEO-оптимізація та SSR/ISR",
          "description": "Оптимізація сайту для Google: метадані, швидкість, адаптивність, структуровані дані, карта сайту, індексація. Використання SSR/ISR для найкращих позицій у пошуку.",
          "focus": "Для сайтів, що хочуть отримувати органічний трафік та покращити видимість.",
          "tech": ["Next.js", "React", "Vercel", "Google Search Console"]
        }
      ],
      "technologies": [
        "Django",
        "DRF",
        "FastAPI",
        "Next.js",
        "React",
        "PostgreSQL",
        "Supabase",
        "Node.js"
      ]
    }, {
      "name": "AI-інтеграції та кастомні AI-рішення",
      "services": [
        {
          "title": "AI-чатботи та автоматичні консультанти",
          "description": "Створення розумних чатботів, які можуть відповідати на питання клієнтів, консультувати, давати рекомендації, проводити через сервіс або заміну частину підтримки. Можуть працювати на сайті, у Telegram, WhatsApp або всередині корпоративної системи.",
          "focus": "Підходить компаніям, які хочуть зменшити навантаження на підтримку та покращити швидкість відповідей.",
          "tech": ["OpenAI API", "FastAPI", "Telegram API", "LangChain"]
        },
        {
          "title": "Генерація документів, листів і відповідей",
          "description": "Автоматичне створення договорів, комерційних пропозицій, email-листів, технічних описів, звітів і шаблонних відповідей. Система аналізує дані клієнта та формує текст відповідно до стилю й контексту.",
          "focus": "Для бізнесів, яким потрібно швидко створювати багато типових документів без ручної підготовки.",
          "tech": ["OpenAI API", "Python", "LangChain"]
        },
        {
          "title": "RAG-системи та персональні AI-асистенти",
          "description": "Розробка асистентів, які працюють з власними документами компанії. Вони шукають відповіді у внутрішній базі знань, PDF-файлах, Google Docs чи CRM. Використання Retrieval-Augmented Generation (RAG) для максимально точних відповідей.",
          "focus": "Для компаній з великою кількістю документації: техпідтримка, юристи, навчальні платформи.",
          "tech": ["LangChain", "OpenAI API", "Vector DB", "FastAPI"]
        },
        {
          "title": "Аналіз тексту, аудіо та зображень (OCR, STT, TTS)",
          "description": "Створення систем, що розпізнають текст зі зображень, перетворюють голос у текст, або озвучують відповіді. Можлива побудова аналітики: класифікація тексту, витяг ключових даних, перевірка якості дзвінків.",
          "focus": "Для служб підтримки, логістики, документообігу, медіа та чатботів.",
          "tech": ["OpenAI Vision", "Whisper", "TTS API", "OCR-python"]
        },
        {
          "title": "Інтеграція OpenAI, Claude, Gemini та інших моделей",
          "description": "Додавання у продукт можливостей великих мовних моделей: генерація контенту, аналіз, пошук, автоматичні висновки, діалоги. Підбір моделі під задачу та бюджет.",
          "focus": "Для сервісів, які хочуть використовувати найсучасніші AI-можливості.",
          "tech": ["OpenAI API", "Claude API", "Gemini API"]
        },
        {
          "title": "Автоматизація внутрішніх бізнес-процесів",
          "description": "Побудова інструментів, які виконують рутинні завдання: перевірка документів, генерація відповідей, обробка заявок, формування звітів, робота з таблицями або CRM. AI адаптується під конкретний процес компанії.",
          "focus": "Для компаній, що хочуть підвищити ефективність та скоротити час на щоденну рутину.",
          "tech": ["Python", "FastAPI", "OpenAI API", "Google Sheets API"]
        }
      ],
      "technologies": ["Python", "OpenAI API", "LangChain", "FastAPI"]
    }, {
      "name": "Telegram- та Viber-боти",
      "services": [
        {
          "title": "Боти для замовлень і консультацій",
          "description": "Розробка ботів, які дозволяють клієнтам оформляти замовлення, отримувати консультації, ставити питання та отримувати відповіді 24/7. Бот може підключатись до бази даних, показувати товари, приймати заявки та зберігати їх у CRM.",
          "focus": "Підходить для магазинів, сервісів та компаній, яким потрібне швидке обслуговування клієнтів без участі менеджера.",
          "tech": ["Python", "aiogram", "pyTelegramBotAPI", "PostgreSQL"]
        },
        {
          "title": "Боти з меню, кнопками та сценаріями",
          "description": "Створення структурованих ботів із зручним меню, кнопками, покроковими сценаріями, воронками продажів та логікою переходів. Можливість гнучких діалогів, збирання даних, анкетування та персоналізації контенту.",
          "focus": "Потрібно бізнесам, які хочуть вести користувача через певний шлях: від привітання до покупки чи реєстрації.",
          "tech": ["aiogram", "Python", "FSM (Finite State Machine)"]
        },
        {
          "title": "Оплати, підписки та система доступів",
          "description": "Інтеграція прийому платежів у боті: картки, Google Pay/Apple Pay, LiqPay, Stripe. Реалізація автоматичних підписок, контролю доступу до контенту, закритих груп та преміум-матеріалів.",
          "focus": "Підходить онлайн-школам, контент-проєктам, сервісам з доступом по підписці та eCommerce.",
          "tech": [
            "Telegram Payments API",
            "LiqPay API",
            "Stripe API",
            "PostgreSQL"
          ]
        },
        {
          "title": "Інтеграції з Google Sheets, CRM та іншими API",
          "description": "Підключення бота до зовнішніх сервісів: Google Sheets, CRM, власних API компанії. Синхронізація даних, оновлення статусів, збереження заявок, передача даних менеджерам.",
          "focus": "Для бізнесів, що хочуть повну автоматизацію — від заявки до обробки у CRM.",
          "tech": ["Google Sheets API", "REST API", "Python", "PostgreSQL"]
        },
        {
          "title": "Автоматизація внутрішніх бізнес-процесів через ботів",
          "description": "Створення ботів для внутрішнього використання: контроль задач, облік товарів, оформлення внутрішніх заявок, логістика, звіти, HR-процеси. Бот може замінити частину корпоративних інструментів.",
          "focus": "Підійде компаніям, які хочуть зменшити кількість ручних операцій і впорядкувати робочі процеси.",
          "tech": ["Python", "aiogram", "PostgreSQL", "Webhook/Long Polling"]
        }
      ],
      "technologies": ["Python", "aiogram", "pyTelegramBotAPI", "PostgreSQL"]
    },{
      "name": "Автоматизації, скрейпінг і скрипти",
      "services": [
        {
          "title": "Парсинг сайтів та моніторинг цін",
          "description": "Створення систем для збору інформації з будь-яких сайтів: товари, описи, ціни, зміни в наявності. Автоматичні моніторинги, які перевіряють сторінки за графіком і повідомляють про зміни або формують звіти.",
          "focus": "Для магазинів, маркетологів, реселерів, аналітиків та тих, хто хоче відстежувати конкурентів.",
          "tech": ["BeautifulSoup", "Scrapy", "Playwright", "Python"]
        },
        {
          "title": "Автоматична робота в браузері",
          "description": "Розробка скриптів, які виконують дії в браузері замість людини: авторизація, натискання кнопок, заповнення форм, завантаження чи публікація даних. Працює через Playwright або Selenium з максимальною стабільністю.",
          "focus": "Для компаній, які хочуть автоматизувати рутинні процеси, що виконуються вручну.",
          "tech": ["Playwright", "Selenium", "Python"]
        },
        {
          "title": "Масові дії в інтернет-сервісах",
          "description": "Автоматизація великої кількості повторюваних задач: масова публікація, обробка заявок, розсилка повідомлень, імпорт/експорт даних, оновлення каталогів чи баз. Підтримка авторизації, cookies та anti-bot рішень.",
          "focus": "Підходить маркетплейсам, контент-виробникам, адміністраторам сайтів та eCommerce.",
          "tech": ["Playwright", "Selenium", "Python", "API інтеграції"]
        },
        {
          "title": "Збір і обробка даних будь-якої складності",
          "description": "Збір структурованих і неструктурованих даних, очищення, нормалізація, агрегація та підготовка до подальшої аналітики. Можливість створення власних баз даних або інтеграції у Google Sheets/CRM.",
          "focus": "Підійде аналітикам, магазинами, логістам, HR-відділам або тим, хто працює з великими обсягами інформації.",
          "tech": ["Python", "Pandas", "PostgreSQL", "Excel/Sheets API"]
        },
        {
          "title": "Генерація звітів, експорти і конвертації",
          "description": "Автоматичне створення звітів у PDF, Excel або Google Sheets. Конвертація форматів, формування зведених таблиць, надсилання звітів на email або в Telegram. Можлива повна автоматизація за розкладом.",
          "focus": "Для бізнесів, які регулярно складають звіти або виконують рутинні операції з файлами.",
          "tech": ["Python", "Pandas", "OpenPyXL", "Google Sheets API"]
        }
      ],
      "technologies": [
        "Python",
        "Playwright",
        "Selenium",
        "BeautifulSoup",
        "Scrapy"
      ]
    },{
      "name": "Мікросервіси та програмні інструменти",
      "services": [
        {
          "title": "API-сервіси та бекенд-модулі",
          "description": "Розробка мікросервісів та backend-компонентів для обробки даних, авторизації, логіки роботи продукту, інтеграцій з іншими системами. Легка масштабованість, швидкодія та можливість додавати нові функції без змін у всій системі.",
          "focus": "Підходить компаніям, які хочуть розділити продукт на незалежні модулі або інтегрувати новий функціонал у вже існуючу інфраструктуру.",
          "tech": ["Python", "FastAPI", "C++", "Java", "Docker"]
        },
        {
          "title": "Утиліти для роботи з файлами та даними",
          "description": "Створення програм і скриптів для обробки великих обсягів файлів: конвертація, аналіз, фільтрація, об’єднання, розпакування, перевірка якості даних. Можлива повна автоматизація та запуск за розкладом.",
          "focus": "Потрібно бізнесам, де щодня працюють із файлами, таблицями, логами чи складними форматами.",
          "tech": ["Python", "C++", "Java", "Pandas"]
        },
        {
          "title": "Локальні інструменти для Windows/Linux",
          "description": "Розробка програм, що працюють напряму на комп’ютері користувача: помічники, менеджери файлів, утиліти для роботи зі сторонніми системами, аналізатори, локальні сервери та внутрішні панелі керування.",
          "focus": "Підходить компаніям, які хочуть мати свої автономні інструменти, що працюють без доступу до інтернету або інтегруються з локальним середовищем.",
          "tech": ["Python", "C++", "Java", "Qt", "CLI Tools"]
        },
        {
          "title": "Автоматичні конвертори, монітори та трекери",
          "description": "Створення інструментів, які автоматично конвертують файли, стежать за змінами у системах, записують події, ведуть статистику та надсилають сповіщення. Можлива інтеграція з API, базами даних або зовнішніми сервісами.",
          "focus": "Для компаній, які хочуть підвищити ефективність роботи та мати контроль над даними й процесами в реальному часі.",
          "tech": ["Python", "C++", "Java", "PostgreSQL"]
        }
      ],
      "technologies": ["Python", "C++", "Java"]
    },{
      "name": "Інтеграції та зв’язування сервісів",
      "services": [
        {
          "title": "Зв’язування Google Sheets з Telegram-ботами",
          "description": "Створення інтеграцій, які дозволяють автоматично зберігати дані з бота у таблиці або отримувати інформацію з таблиці в бот. Підтримка оновлень, черг, фільтрації, автоматичних відповідей та логування змін.",
          "focus": "Підійде для магазинів, записів на послуги, логістики, анкет, опитувальників, CRM-систем на основі Sheets.",
          "tech": ["Google Sheets API", "Telegram API", "Python", "Webhooks"]
        },
        {
          "title": "Інтеграція сайту з CRM-системами",
          "description": "Підключення форм, заявок, кошиків, чатів або користувацьких кабінетів до CRM. Автоматичне створення лідів, оновлення статусів, синхронізація клієнтів і замовлень, push-нотифікації та двосторонній обмін даними.",
          "focus": "Для бізнесів, які хочуть, щоб менеджери отримували заявки без ручного перенесення.",
          "tech": ["REST API", "Webhooks", "Python", "Requests"]
        },
        {
          "title": "Зв’язування CRM із AI-моделями",
          "description": "CRM автоматично аналізує звернення, генерує відповіді, формує резюме по клієнту, шукає інформацію у базі, або автоматично обробляє заявки. Підключення OpenAI, Claude, Gemini для розумних процесів.",
          "focus": "Підходить компаніям, які хочуть автоматизувати обробку клієнтських даних та переписку.",
          "tech": ["OpenAI API", "REST API", "Python", "LangChain"]
        },
        {
          "title": "Інтеграції маркетплейсів та платіжних систем",
          "description": "Зв’язування сайту, CRM або бота з платіжними системами (LiqPay, Stripe, Wayforpay), маркетплейсами та службами доставки. Автоматичні статуси замовлень, формування накладних, повідомлення клієнтів.",
          "focus": "Потрібно eCommerce, доставкам, онлайн-магазинам і сервісам із прийомом оплат.",
          "tech": ["Stripe API", "LiqPay API", "Marketplaces API", "Python"]
        },
        {
          "title": "Webhooks, REST API та створення конекторів",
          "description": "Розробка конекторів між будь-якими системами: сайти, CRM, таблиці, складські програми, AI-сервіси, месенджери. Підтримка webhooks, автоматичних тригерів, періодичних задач і двосторонніх обмінів.",
          "focus": "Для бізнесів, які хочуть об’єднати всі процеси в одну екосистему.",
          "tech": ["Python", "Requests", "REST API", "Webhooks"]
        }
      ],
      "technologies": ["Python", "Requests", "Webhooks", "API-інтеграції"]
    },{
      "name": "Автоматизація бізнес-процесів у n8n",
      "services": [
        {
          "title": "Побудова складних автономних робочих потоків",
          "description": "Створення масштабованих n8n-воркфлоу з логікою, чергами, валідацією даних, умовами та багаторівневими сценаріями. Повна автоматизація без ручного втручання.",
          "focus": "Компаніям, що хочуть перевести рутинні операції в автопілот: заявки, обробка даних, сповіщення, обмін між сервісами.",
          "tech": ["n8n", "Webhooks", "HTTP Requests", "JavaScript"]
        },
        {
          "title": "Інтеграції сайту, CRM, Telegram та AI",
          "description": "Об'єднання веб-сайтів, CRM-систем, Telegram-ботів, email-сервісів та AI-моделей в єдину екосистему. Автоматичне перенесення даних, створення лідів, відповідей і обробка повідомлень.",
          "focus": "Для бізнесів, що хочуть синхронізувати усі канали взаємодії з клієнтом.",
          "tech": ["n8n", "REST API", "Telegram API", "OpenAI API"]
        },
        {
          "title": "Обробка заявок, форм та оплат",
          "description": "Автоматичний прийом веб-форм, генерація лідів у CRM, перевірка оплат, формування замовлень, прив’язка до Google Sheets або баз даних.",
          "focus": "Магазинам, сервісам, формам запису, SaaS-продуктам.",
          "tech": ["n8n", "Stripe API", "LiqPay API", "Webhooks"]
        },
        {
          "title": "Розсилки, нагадування та нотифікації",
          "description": "Створення систем нотифікацій: email, Telegram, SMS. Автоматичні нагадування, тригери, події, сегментація та розсилки з умовною логікою.",
          "focus": "Компаніям, які хочуть підтримувати контакт із клієнтами без участі менеджера.",
          "tech": ["n8n", "SMTP", "Telegram Bots", "CRON"]
        },
        {
          "title": "Генерація документів і файлів",
          "description": "Автоматичне створення PDF, Excel, актів, договорів, рахунків. Заповнення шаблонів, підстановка змінних, збереження в Google Drive та відправка клієнтам.",
          "focus": "Бізнесам, які потребують автоматичного оформлення документів.",
          "tech": ["n8n", "Google Docs API", "Google Drive API", "JavaScript"]
        },
        {
          "title": "Кастомні ноди на JavaScript",
          "description": "Розширення можливостей n8n через власні функціональні блоки. Написання логіки, обробників, конекторів та парсерів під специфічні задачі.",
          "focus": "Коли стандартних нод n8n недостатньо.",
          "tech": ["JavaScript", "n8n Function Node", "Custom Code"]
        },
        {
          "title": "Python-скрипти у воркфлоу n8n",
          "description": "Інтеграція Python-коду в робочі потоки: аналітика, парсинг, AI-обробка, робота з файлами або складною бізнес-логікою.",
          "focus": "Проекти, що потребують складних розрахунків або спеціальних бібліотек.",
          "tech": ["Python", "REST API", "n8n Code", "Requests"]
        },
        {
          "title": "Створення повністю автономних цифрових систем",
          "description": "Побудова систем, які самі приймають рішення: обробляють заявки, перевіряють оплату, генерують документи, відповідають клієнтам, оновлюють CRM — все без людини.",
          "focus": "Бізнесам, які хочуть максимальну автоматизацію процесів.",
          "tech": ["n8n", "AI API", "CRON", "REST API"]
        }
      ],
      "technologies": [
        "n8n",
        "JavaScript",
        "Python",
        "Google Services",
        "REST API",
        "Webhooks",
        "Telegram API"
      ]
    }
  ]
}
